felmue/uiflow-micropython/m5stack/boards/M5STACK_Unit_PoEP4/mpconfigboard.h
/*
 * SPDX-FileCopyrightText: 2025 M5Stack Technology CO LTD
 *
 * SPDX-License-Identifier: MIT
 */

#ifndef MICROPY_HW_BOARD_NAME
    #define MICROPY_HW_BOARD_NAME "M5STACK Unit PoEP4"
#endif

#ifndef MICROPY_HW_MCU_NAME
    #define MICROPY_HW_MCU_NAME "ESP32P4"
#endif

#define MICROPY_HW_USB_VID 0x303A
#define MICROPY_HW_USB_PID 0x817A
#define MICROPY_HW_USB_MANUFACTURER_STRING "M5Stack"
#define MICROPY_HW_USB_PRODUCT_FS_STRING "Unit PoEP4(UiFlow)"

#define MICROPY_PY_ESPNOW        (0)
#define MICROPY_PY_BLUETOOTH     (0)
// FIXME
#define MICROPY_PY_NETWORK_WLAN  (1)
#define MICROPY_PY_NETWORK_LAN   (1)
